# encoding: utf-8
# @@@@@@@@@@@@@@@@@@@@@@@@@@@实验用的demo@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
"""
@author: 沈缘
@contact: 1245869619@qq.com
@software: PyCharm
@file: demo.py
@time: 2021/8/28 18:01
"""
# c = "" > "2021-08-01 00:00:00"
# print(c)
time = "2021-07-01 06:00:00"
c = time > "2021-08-01 00:00:00"
print("是否大于筛选开始时间：", c)
a = time < "2021-08-25 23:59:59"
print("是否小于筛选结束时间：", a)
o = c and a
print(o)

山西介休义棠城峰煤业有限公司,91700
山西灵石华苑煤业有限公司,105000
山西汾西瑞泰井矿正珠煤业有限公司,62000
山西安鑫煤业有限公司,125400
山西安泽玉华煤业有限公司,128300
山西玉和泰煤业有限公司,119500
阳泉煤业集团安泽登茂通煤业,109700
山西泓翔煤业有限公司,109600
山西古县兰花宝欣煤业有限公司,63000
山西古县老母坡煤业有限公司,57400
山西古县安吉欣源煤业有限公司,55100
山西古县金谷煤业有限公司,54000
山西古县西山登福康煤业有限公司,57100
山西霍宝干河煤矿有限公司,56000
山西汾河焦煤股份回坡底煤矿,64600
山西陆合集团基安达煤业有限公司,93700
山西汾河焦煤股份有限公司三交河矿,99000
霍州煤电集团李雅庄矿,55800
霍州煤电集团辛置煤矿,53400
山西华晋明珠煤业有限责任公司,100300
山西潞安集团蒲县黑龙煤业,81600
山西潞安集团蒲县伊田煤业,81500
山西煤炭进出口集团蒲县豹子沟煤业,90600
山西蒲县宏源集团郭家山煤业,99200
山西潞安集团蒲县隰东煤业,73700
山西潞安集团蒲县后堡煤业,63900
山西蒲县蛤蟆沟煤业有限公司,107700
山西蒲县华胜煤业有限公司,53700
山西潞安集团蒲县新良友煤业,61800
山西蒲县宏源集团官庄河煤业,115900
太原煤炭气化集团东河煤矿,96000
山西蒲县宏源集团富家凹煤业,102300
山西汾西正佳煤业有限责任公司,44800
山西保利裕丰煤业有限公司,55400
山西乡宁焦煤集团台头煤焦,90800
山西煤炭运销集团同富新煤业,49000
山西煤炭运销集团吉县盛平煤业,122100
山西乡宁焦煤集团神角煤业,98900
山西乡宁焦煤集团台头前湾煤业,119500
大同煤矿集团临汾宏大隆博煤业,99200
山西华宁焦煤有限责任公司,89300
中煤华晋韩咀煤业有限责任公司,88900
山西乡宁焦煤集团毛则渠煤炭,88600
山西华晋吉宁煤业有限责任公司,129400
山西天润煤化集团德通煤业,111100
山西临汾西山生辉煤业有限公司,79700
皖北煤电临汾天煜恒晋煤业,87500
皖北煤电临汾天煜恒昇煤业,80500
山西晋煤集团临汾晋牛煤矿投资,90300
山西煤炭运销集团金辛达煤业,91200
山西翼城首旺煤业有限责任公司,108500
霍州煤电吕梁山煤电方山木瓜煤矿,54700
山西方山金晖凯川煤业有限公司,58300
山西神州煤业有限责任公司,64300
山西临县华润联盛黄家沟煤业有限公司,92600
山西东辉集团邓家庄煤业有限公司,117800
山西柳林煤矿有限公司,108600
山西柳林大庄煤矿有限责任公司,83800
山西柳林鑫飞下山峁煤业有限公司,85300
山西煤炭运销集团金达煤业有限公司,67800
山西兴县华润联盛峁底煤业有限公司,72400
山西兴县华润联盛车家庄煤业,73100
山西兴县华润联盛关家崖煤业,72900
大同煤矿集团朔州朔煤王坪煤电,64800
中煤平朔集团有限公司安太堡露天矿,41400
太原煤气化股份有限公司炉峪口煤矿,90800
太原煤气化龙泉能源发展有限公司,57000
山西煤炭运销集团三聚盛煤业,87900
山西阳煤集团南岭煤业有限公司,83300
山西焦煤集团有限责任公司官地煤矿,73000
山西焦煤集团有限责任公司杜儿坪矿,75300
太原东山王封煤业有限公司,87800
山西王家岭煤业有限公司,69500
山西忻州神达望田煤业有限公司,84500
中煤华晋集团有限公司王家岭矿,99300
山西煤炭运销集团三元石窟煤业,169000
山西长治郊区三元南耀吉安煤业,129800
山西黄土坡鑫运煤业有限公司,98500
山西马军峪煤焦有限公司,128800,
山西黄土坡鑫能煤业有限公司,90500,
山西通洲集团安达煤业有限公司,133600,
山西通洲集团安神煤业有限公司,102000,
山西康伟集团孟子峪煤业有限公司,124900,
山西汾西太岳煤业股份太岳煤矿,119000,
山西沁新集团新达煤业有限公司,142300,
山西康伟集团南山煤业有限公司,121500,
山西金晖隆泰煤业有限公司,58500,
山西新超煤业有限公司,110000,
山西长沁新兴煤业有限公司,116700,
山西沁源康伟森达源煤业有限公司,101900
山西沁源凤凰台煤业有限公司,124900
山西新升煤业有限公司,121100
山西省长治经坊煤业有限公司,157400
山西潞安矿业集团高河煤矿,129100
山西潞安集团司马煤业有限公司,175600
山西东庄煤业有限公司,140700
山西马堡煤业有限公司,93800
山西三元福达煤业有限公司,131400
山西新村煤业有限公司,62900
